In [1]:
## Importando libreria
import pandas as pd
import numpy as np

# 1. Creando un dataFrame usando arrays

## 1.1 Opcion 1

In [3]:
# Creando un array
data = np.array([[4,6],[2,7],[1,6]])

In [6]:
# Creando un dataframe
dataframe = pd.DataFrame(data, index=['row1','row3','row3'], columns=['col1','col2'])

In [7]:
dataframe

      col1  col2
row1     4     6
row3     2     7
row3     1     6

## 1.2 Opcion 2

In [8]:
data2 = [[4,6],[2,7],[1,6]]

In [10]:
dataframe2 = pd.DataFrame(data2, index=['row1','row3','row3'], columns=['col1','col2'])

In [11]:
dataframe2

      col1  col2
row1     4     6
row3     2     7
row3     1     6

# 2 Creando un dataframe usando diccionarios

In [12]:
## Listas para el ejemplo
states = ['Nuevo Leon', 'Michoacan', 'CDMX']
population = [23423234234,2342412342,23424242342]

In [13]:
# Almacenando listas en un diccionarop
dict_states = {'states':states,'population':population}

In [14]:
# Creando un dataframe
df_population = pd.DataFrame(dict_states)

In [15]:
# Mostrando el dataframe
df_population

       states   population
0  Nuevo Leon  23423234234
1   Michoacan   2342412342
2        CDMX  23424242342

# 3 Creando un dataframe con archivo csv

In [17]:
# Leyendo el archivo csv
df_family = pd.read_csv('familia.csv')

In [18]:
df_family

   Nombres   Edad
0   Moises     24
1  Lluvia      46
2   Aaron      22